Revit 2026 API

# NonContinuousRailStructureRemoveNonContinuousRail Method

---

Removes Non-Continuous Rail from the Rail Structure.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveNonContinuousRail(
	int index
)
```
```vb
Public Sub RemoveNonContinuousRail (
	index As Integer
)
```
```cpp
public:
void RemoveNonContinuousRail(
	int index
)
```
```fsharp
member RemoveNonContinuousRail :
        index : int -> unit
```

#### Parameters

index Int32
     Non-Continuous Rail index.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The index index is out of range. |

#### Reference

NonContinuousRailStructure Class

Autodesk.Revit.DB.Architecture Namespace